class BankAccount: #สร้างคลาสบัญชีธนาคาร
    def __init__(self, account_number, balance, name): #สร้างฟังก์ชันและพารามิเตอร์
        self.__account_number = account_number #การกำหนดค่าให้กับตัวแปรใช้ double underscores เพื่อระบุให้เป็น private
        self.__balance = balance #การกำหนดค่าให้กับตัวแปร
        self.__name = name #การกำหนดค่าให้กับตัวแปร
    def get_Accout_number(self):  #สร้างฟังก์ชันเก็บเลขบัญชี
        return self.__account_number # สร้างเมธอดเพื่อให้เข้าถึงคุณสมบัติ
    def __get_balance(self): #สร้างฟังก์ชันเก็บเงินในบัญชี
        return self.__balance #สร้างเมธอดเพื่อให้เข้าถึงคุณสมบัติ
    def get_name(self): #สร้างฟังก์ชันเก็บชื่อเจ้าของบัญชี
        return self.__name #สร้างเมธอดเพื่อให้เข้าถึงคุณสมบัติ

    def deposite(self, amount): #สร้างฟังก์ชันในส่วนของการฝากเงิน
        if amount > 0: #ถ้าค่าที่เข้ามามากกว่า 0
            self.__balance += amount # ให้บวกค่าค่าเงินในบัญชีและค่าที่เข้ามารวมกัน
            print('ฝากเงินเข้าบัญชีจำนวน:', amount) #แสดงค่าที่เข้ามา
            print('ยอดเงินคงเหลือ:', self.__balance) #แสดงค่าที่รวมกันแล้ว
        else: #ถ้าค่าที่เข้ามาเป็นอื่น
            print('กรุณาใส่จำนวนเงินที่ถูกต้อง') #ระบบจะแจ้งเตือนให้ใส่ค่าจำนวนเงิน

    def withdraw(self, amount): #สร้างฟังก์ชันในส่วนของการถอนเงิน
        if 0 < amount <= self.__balance: #ถ้าค่าที่ต้องการถอนมากกว่า 0
            self.__balance -= amount #จะลบค่าที่ต้องการถอนออกจากเงินในบัญชี
            print('ถอนเงินจากบัญชีจำนวน:', amount) #แสดงค่าที่ต้องการถอน
            print('ยอดเงินคงเหลือ:', self.__balance) #แสดงเงินหลังจากการถอน
        elif amount > self.__balance: #ถ้าค่าที่ต้องการถอนมากกว่าเงินในบัญชี
            print('ยอดเงินไม่เพียงพอ') #ระบบจะแจ้งเตือนว่าเงินในบัญชีไม่พอกับเงินที่จะถอน
        else: #ถ้าค่าที่เข้ามาเป็นอื่น
            print('กรุณาใส่จำนวนเงินที่ถูกต้อง') #ระบบจะแจ้งเตือนให้ใส่ค่าจำนวนเงิน

    def add_interest(self, interest_rate=0.03): #สร้างฟังก์ชันในส่วนของดอกเบี้ยเงินฝาก ดอกเบี้ยร้อยละ 0.03
        self.interest_rate = interest_rate #กำหนดค่าให้กับตัวแปร
        interest = self.__balance * self.interest_rate #คูณค่าเงินในบัญชีรวมเข้ากับเปอร์เซ็นต์ดอกเบี้ย
        self.__balance += interest #รวมค่าเงินในบัญชีกับค่าดอกเบี้ยที่เพิ่ม
        print('เพิ่มดอกเบี้ยจากบัญชีออมทรัพย์:', interest) #แสดงค่าดอกเบี้ยที่เพิ่ม
        print('ยอดเงินคงเหลือ:', self.__balance) #แสดงค่าที่รวมกับดอกเบี่ยแล้ว

    def checking(self, amount, vat=30): #สร้างฟังก์ชันในส่วนของการจ่ายเช็ค ค่าธรรมเนียม 30
        self.vat = vat #กำหนดค่าให้กับตัวแปร
        print('ต้องการจ่ายเช็คจำนวน:', amount) #แสดงค่าเช็คที่ต้องการจ่าย
        if amount > self.__balance: #ถ้าค่าที่ต้องการนั้นมากกว่าเงินในบัญชี
            print('ยอดเงินไม่เพียงพอ') #ระบบจะแจ้งเตือนว่าเงินในบัญชีไม่พอกับเงินที่ต้องการ
            self.__balance -= self.vat #จะหักค่าธรรมเนียมออกจากเงินในบัญชี
            print('หักค่าธรรมเนียม:', self.vat) #แสดงค่าธรรมเนียมที่ตั้งไว้
            print('ยอดเงินคงเหลือ:', self.__balance) #แสดงค่าที่หักค่าธรรมเนียมแล้ว
        else: #ถ้าเป็นอื่น
            self.__balance -= self.vat #จะหักค่าธรรมเนียมออกจากเงินในบัญชี
            print('หักค่าธรรมเนียม:', self.vat) #แสดงค่าธรรมเนียมที่ตั้งไว้
            self.withdraw(amount) #เรียกใช้attributeของการถอนเงิน

    def show(self): #สร้างฟังก์ชันในการแสดงข้อมูลเลขบัญชี ชื่อ จำนวนเงิน
        print('เลขบัญชี: '+ str(self.get_Accout_number()), '| ชื่อบัญชี: ' +str(self.get_name())) #แสดงเลขบัญชีและชื่อเจ้าของบัญชี
        print('ยอดเงินในบัญชี: '+str(self.__get_balance())) #แสดงยอดเงินในบัญชี

#ส่วนของการแสดงผล
Acc1=BankAccount(10203040,10000,'Song Yong') #กำหนดค่าลงในพารามิเตอร์ของคลาสบัญชีธนาคาร
Acc1.show() #เรียกใช้ฟังก์ชันในการแสดงข้อมูลเลขบัญชี ชื่อ จำนวนเงิน
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
Acc1.deposite(5000) #เรียกใช้ฟังก์ชันในส่วนของการฝากเงิน
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
Acc1.withdraw(3000) #เรียกใช้ฟังก์ชันในส่วนของการถอนเงิน
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
Acc1.add_interest() #เรียกใช้ฟังก์ชันในส่วนของดอกเบี้ยเงินฝาก
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
print('-----------------------------------') #แสดง-ในที่นี้ใช้เป็นเส้นแบ่งข้อมูล
Acc2=BankAccount(11223344,10000,'Yun Yue')#กำหนดค่าลงในพารามิเตอร์ของคลาสบัญชีธนาคาร
Acc2.show() #เรียกใช้ฟังก์ชันในการแสดงข้อมูลเลขบัญชี ชื่อ จำนวนเงิน
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
Acc2.checking(20000) #เรียกใช้ฟังก์ชันในส่วนของการจ่ายเช็ค
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
Acc2.checking(2000) #เรียกใช้ฟังก์ชันในส่วนของการจ่ายเช็คแต่เปลี่ยนค่าในพารามิเตอร์
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
print('-----------------------------------') #แสดง-ในที่นี้ใช้เป็นเส้นแบ่งข้อมูล
Acc1.show()#เรียกใช้ฟังก์ชันในการแสดงข้อมูลเลขบัญชี ชื่อ จำนวนเงิน
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
Acc2.show()#เรียกใช้ฟังก์ชันในการแสดงข้อมูลเลขบัญชี ชื่อ จำนวนเงิน
print(' ') #แสดงข้อความว่างในที่นี้ใช้เป็นบรรทัดว่าง
